app/views/articles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 7]]
---
        </li>
        <li><small><%= pluralize(@article.user.articles.count, "Post") if @article.user.articles %></small></li>