backup/app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "Jin3"], ["password_digest", "$2a$10$Kr9Vhrc.W15y6FTDfC0Zieyn3J8CoJo0UOcYRAkDPAMMUgzMDgfwu"], ["updated_at", "2019-04-23 13:41:42.435554"], ["id", 1]]

  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]