app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "aasdf"], ["description", "asdfasdfsadf"], ["created_at", "2019-04-23 11:38:21.692730"], ["updated_at", "2019-04-23 11:38:21.692730"], ["user_id", 1]]
---
  def create
    # render plain: params[:article].inspect
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save