app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      @user.image = req["public_id"]

      # cludinary
    end


    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$oEmVm.89o1mqEY6WTBG9BeQXaAep4vECXHuVCol9BefhivM/732ie"], ["updated_at", "2019-04-24 09:13:18.814435"], ["id", 16]]
---
  def update
    @user = User.find(params[:id])
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])

      @user.image = req["public_id"]
      @user.update_attributes(user_params)

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 7]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 8]]
---
  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)